/**
 * File: Statistics.java
 * type: interface
 * @author Data
 * -----------------
 * აქ იქნება სტატისტიკა. მას ექნება როგორც static მეთოდები (რომლებიც საერთო სტატისტიკურ მონაცემებს მოგვცემს.)
 * ასევე ჩვეულებრივი, ობიექტთან ასოცირებული მეთოდები. ამ კლასის ობიექტები უნდა გააჩნდეს Championship-კლასს.
 * ცხადია, რომ ეს ინტერფეისი, უფრო სწორად მისი იმპლემენტატორი კლასი არაფერს შეცვლის ბაზაში. უბრალოდ დაამუშავებს ინფორმაციას.
 */
package model.mainclasses;

public interface Statistics {

}
